85hzc/ask_433/stm32f1/Src/App.c
/**
  ******************************************************************************
  * File Name          : App.c
  * Description        : Application file for gesture control
  ******************************************************************************
  *Author:  JL
  *Date:    2019/1/18
  ******************************************************************************
  **/
  
#include "main.h"  
#include "stm32f1xx_hal.h"
#include "VCNL4035.h"
#include "I2C.h"
#include "App.h"
#include "stdio.h"
#include "arm_math.h"
#include "arm_const_structs.h"
#include "siliconSi115x.h"

extern volatile uint16_t I2C_SDA_PIN;
extern volatile uint16_t I2C_SCL_PIN;

static uint32_t tickstart;
uint64_t sys_tick=0;                                //系统tick计数
gs_struct gs={0};
uint16_t led_counter=0;
//uint16_t led
uint8_t led_flag=0;
gs_comb_struct comb_ges;

//变量初始化
void App_Var_Init(void)
{
    //gs.sample_counter=0;
    //gs.sample_ready_flag=0;
    //gs.sample_start_flag=0;
    //gs.sample_frequency=SAMPLE_FREQUENCY_DEF;
    gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
    gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
    for (uint8_t i=0;i<GES_CHN_NUM;i++)
    {
        gs.sample_down_limit[i]=SAMPLE_DOWN_LIMIT_DEF;
        gs.sample_up_limit[i]=SAMPLE_UP_LIMIT_DEF;
    }

    memset(&comb_ges, 0, sizeof(gs_comb_struct));
}

//应用初始化
void App_Init(void)
{
    //uint16_t read_val;
    //uint8_t res;

    App_Var_Init();

    tickstart = HAL_GetTick();
    while((HAL_GetTick() - tickstart) <= 200)//delay
        ;

#if(SENSOR3==1)
    I2C_SDA_PIN = SDA1_Pin;
    I2C_SCL_PIN = SCL1_Pin;
    I2C_init();
    DEMO_Init();
    I2C_SDA_PIN = SDA2_Pin;
    I2C_SCL_PIN = SCL2_Pin;
    I2C_init();
    DEMO_Init();
    I2C_SDA_PIN = SDA3_Pin;
    I2C_SCL_PIN = SCL3_Pin;
    I2C_init();
    DEMO_Init();
#else
    I2C_SDA_PIN = SDA3_Pin;
    I2C_SCL_PIN = SCL3_Pin;
    I2C_init();
    DEMO_Init();
#endif
    LOG_DEBUG("App_Init!\r\n");
    
    //res=VCNL4035_ReadData(VCNL4035_ID,&read_val);
    //LOG_DEBUG("Read res: %d, ID: 0x%04x\n",res,read_val);

    //VCNL4035_InitGesMode();
}

void LED_Tick_Check(void)
{
    if (led_counter)
    {
        led_counter--;
        if (!led_counter)
        {
            HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_SET);
            HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_SET);
            HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_SET);
            HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_SET);
            HAL_GPIO_WritePin(LED_DCLK_GPIO_Port, LED_DCLK_Pin, GPIO_PIN_SET);
        }
    }
}

//加入一次采样值
//输入：     ps->读取的采样值数组
//返回：     0-->数组未填充完毕
//          1-->数组已填充完毕
uint8_t Ges_Add_Sample(uint16_t *ps)
{
    uint8_t i,j,k;
    uint32_t sum;
    uint16_t ges_sample_raw_cur_temp;

//  res=gs.ges_cur;
//  ges_flag=0;
    for (i=0;i<GES_CHN_NUM;i++)
    {   
        ges_sample_raw_cur_temp=gs.ges_sample_raw_cur;
        gs.ges_sample_raw_array[i][ges_sample_raw_cur_temp]=ps[i];
        ges_sample_raw_cur_temp++;
        //raw数组已填充完毕
        if (ges_sample_raw_cur_temp>=gs.sample_size_raw)
        {
            for (k=0;k<gs.sample_size;k++)
            {
                for (j=0,sum=0;j<GES_SAMPLE_AVE_NUM;j++)
                {
                    sum+=gs.ges_sample_raw_array[i][k*GES_SAMPLE_AVE_NUM+j];
                }
                gs.ges_sample_array[i][k]=(uint16_t)(sum/GES_SAMPLE_AVE_NUM);
            }
        }       
    }
    //在每一帧的开始记录时间
    if (gs.ges_sample_raw_cur==0)
        gs.frame_start_tick=Systick_Get();
    
    gs.ges_sample_raw_cur++;
    if (gs.ges_sample_raw_cur>=gs.sample_size_raw)
    {
        gs.ges_sample_raw_cur=0;
        return 1;
    }
    else
        return 0;
}

//对每一次采样值判断是否手势到来
//输入：     ps->读取的采样值数组
//返回：     0-->数组未完全包含手势
//        1-->数组手势已完毕
uint8_t Ges_Detect_Sample(uint16_t *ps)
{
    uint8_t i,j,k;
    uint32_t sum;
    uint16_t ges_dynamic_sample_raw_cur_temp;
    static uint8_t gesStart = false;

    if(!gesStart && ((ps[0]-gs.sample_base_last[0]>SAMPLE_DOWN_LIMIT_DEF) ||
        (ps[1]-gs.sample_base_last[1]>SAMPLE_DOWN_LIMIT_DEF) ||
        (ps[2]-gs.sample_base_last[2]>SAMPLE_DOWN_LIMIT_DEF)))
    {
#if (LOG_ENABLE)
        LOG_DEBUG("ges start.\r\n");
#endif
        gesStart = true;
        gs.ges_dynamic_sample_size = 0;
        gs.ges_dynamic_sample_raw_cur = 0;
        gs.sample_size = GES_SAMPLE_ARRAY_NUM_L;
        gs.sample_size_raw = GES_SAMPLE_RAW_ARRAY_NUM_L;
    }

    if(gesStart)
    {
        for (i=0;i<GES_CHN_NUM;i++)
        {
            ges_dynamic_sample_raw_cur_temp=gs.ges_dynamic_sample_raw_cur;
            gs.ges_dynamic_sample_array[i][ges_dynamic_sample_raw_cur_temp]=ps[i];
            ges_dynamic_sample_raw_cur_temp++;
        }
        //在每一帧的开始记录时间
        //if (gs.ges_sample_raw_cur==0)
        //    gs.frame_start_tick=Systick_Get();


        if(gesStart &&
            (ps[0]-gs.sample_base_last[0]<SAMPLE_DOWN_LIMIT_DEF) &&
            (ps[1]-gs.sample_base_last[1]<SAMPLE_DOWN_LIMIT_DEF) &&
            (ps[2]-gs.sample_base_last[2]<SAMPLE_DOWN_LIMIT_DEF))
        {
#if (LOG_ENABLE)
            LOG_DEBUG("ges stop.\r\n");
#endif
            gs.ges_sample_raw_cur=0;            //基准值计算数组此时重新开始取值
            gesStart = 0;
            return 1;
        }

        gs.ges_dynamic_sample_raw_cur++;
        if (gs.ges_dynamic_sample_raw_cur>=gs.sample_size_raw)
        {
            LOG_DEBUG("sample array overflow!  hold  approach  leave.\r\n");
            gesStart = 0;
            return 1;
        }

        gs.ges_dynamic_sample_size++; //can be the last array index[23]
    }
    
    return 0;
}

//手势采样技术
/*
void Ges_Tick_Check(void)
{
    gs.sample_counter++;
    if (gs.sample_counter>=gs.sample_frequency)
    {
        gs.sample_counter=0;
        gs.sample_start_flag=1;
    }
}

//中断处理函数
void Ges_It_Handle(void)
{
    if (__HAL_GPIO_EXTI_GET_IT(INT_Pin)!=RESET)  
    {  
        gs.sample_ready_flag=1;
    }
}
*/
#if (0)

//对某一帧进行寻找峰值
//输入： ps      --> 读取的采样值数组
//      chn     --> 寻峰的通道号
//      pindex  --> 峰值的index指针
//返回：             在此帧中具有的手势类型
uint8_t Ges_Peak_Find(uint16_t *ps,uint8_t chn,uint16_t *pindex)
{
    uint16_t i,res,max,min,max_index;
    res=GES_NULL;
    
    //求最大值、最小值及最大值、最小值位置
    for (i=0,max=0,min=0xFFFF,max_index=0;i<gs.sample_size;i++)
    {
        if (ps[i]>max)
        {
            max=ps[i];
            max_index=i;
        }
        if (ps[i]<min)
        {
            min=ps[i];
//          min_index=i;
        }
    }
    
