85hzc/ask_433/stm32f1/Src/App.c
    getSensorDataByHostout(ps);

    if(!ps[0]&&!ps[1]&&!ps[2])
    {
        LOG_DEBUG(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\r\n");
        return;
    }

    res=Ges_Add_Sample(ps);
    //一次数组填充完毕
    if (res==1)
    {
#if (LOG_ENABLE)
        LOG_DEBUG("                                     sample[%d]\r\n",gs.sample_size);
#endif
        //第一次采样数据作为定标用
        //if (!calib_num)
        //if(GES_SAMPLE_ARRAY_NUM_S==gs.sample_size)
        if(0==gs.hold_counter)
        {
            Ges_Calib(firstboot);
            firstboot = false;
            //calib_num++;
            //return;
        }
    }

#if (!LOG_ENABLE)
    LOG_DEBUG("sample[%d] %x[13L 14R 15H 17A 18LE]\r\n",gs.sample_size,gs.last_ges);
#endif

    if(firstboot)
        return;

    res = Ges_Detect_Sample(ps);
    if(!res)//当前手势过程不完整，继续采样
        return;

    res=Ges_DynamicAnalysis();
    if (res)//else return to 10 samples
    {
        /*
        //当前是short采样，改变sample_size继续采样
        if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_S)
        {
            gs.sample_size=GES_SAMPLE_ARRAY_NUM_L;
            gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_L;
            gs.ges_sample_raw_cur=GES_SAMPLE_ARRAY_NUM_S;
            return;
        }*/

        uint64_t tick=Systick_Get();
        
        //上次是HOLD手势,此次不是HOLD且不为空，避免误触发,但是hold之后，要允许leave和approach
        if ((gs.last_ges==GES_LEVEL2_HOLD)&&(res!=GES_LEVEL2_HOLD)&&
            (res!=GES_LEVEL2_APPROACH)&&(res!=GES_LEVEL2_LEAVE))
        {
            LOG_DEBUG("######IGNORE [%x] after GES_LEVEL2_HOLD#######\r\n",res);
            gs.last_ges=GES_NULL;
            gs.last_ges_time=tick;
            return;
        }

        //上次是APPROACH or LEAVE手势,此次是LEFT or RIGHT，避免误触发
        if (((gs.last_ges==GES_LEVEL2_APPROACH) || (gs.last_ges==GES_LEVEL2_LEAVE)) && 
            ((res==GES_LEVEL2_LEFT)||(res==GES_LEVEL2_RIGHT)))
        {
            LOG_DEBUG("######IGNORE [%x] after [%s]#######\r\n",res,(gs.last_ges==GES_LEVEL2_APPROACH)?"APPROACH":"LEAVE");
            gs.last_ges=GES_NULL;
            gs.last_ges_time=tick;
            return;
        }

        //有效手势更新
        if (tick>gs.last_ges_time+GES_DISTANCE_MIN)
        {
            //if(!gs.hold_saveself)
                gs.last_ges=res;
            gs.last_ges_time=tick;
        }
        else//无效手势，间隔过短
        {
            #if 0//实现连续手势，取消间隔700ms手势过滤
            //连续触发接近或者离开手势
            if((gs.last_ges == GES_LEVEL2_LEAVE && res == GES_LEVEL2_LEAVE) ||
                (gs.last_ges == GES_LEVEL2_APPROACH && res == GES_LEVEL2_APPROACH))
            {
                gs.last_ges=res;
                gs.last_ges_time=tick;
            }
            else
            {
                if(!(gs.last_ges == GES_LEVEL2_HOLD && res == GES_LEVEL2_LEAVE))
                {
                    LOG_DEBUG("tick time lease %d ms\r\n",GES_DISTANCE_MIN);
                    return;
                }
                else
                {
                    gs.last_ges=res;
                    gs.last_ges_time=tick;
                }
            }
            #else
                gs.last_ges=res;
                gs.last_ges_time=tick;
                if(!(gs.last_ges == GES_LEVEL2_HOLD && res == GES_LEVEL2_LEAVE))
                {
                    LOG_DEBUG("                                                 tick time lease %d ms, and go on.\r\n",GES_DISTANCE_MIN);
                //    return;
                }
            #endif
        }

        if (res==GES_LEVEL2_UP)
        {
            HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
            LOG_DEBUG("                                                 Ges: UP!\r\n");
            Ges_Log();
            //开SW2
            //HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_SET);
        }
        else if (res==GES_LEVEL2_DOWN)
        {
            HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
            LOG_DEBUG("                                                 Ges: DOWN!\r\n");
            Ges_Log();
            //关SW2
            //HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_RESET);
        }
        else if (res==GES_LEVEL2_LEFT)
        {
#if(COMB_GES==0)
            HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
#endif
            LOG_DEBUG("                                                 Ges: LEFT!\r\n");
#if(COMB_GES==1)
            Ges_Comb(GES_LEVEL2_LEFT);
#endif
            Ges_Log();
        }
        else if (res==GES_LEVEL2_RIGHT)
        {
#if(COMB_GES==0)
            HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
#endif
            LOG_DEBUG("                                                 Ges: RIGHT!\r\n");
#if(COMB_GES==1)
            Ges_Comb(GES_LEVEL2_RIGHT);
#endif
            Ges_Log();
            //开SW1
            //HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_SET);
        }
#if(HOLD_GES==1)
        else if (res==GES_LEVEL2_HOLD)
        {
            static uint8_t sw_state=0;
            
//                  gs.hold_counter++;
//                  if (gs.hold_counter==0)
//                  {
//                      HAL_GPIO_WritePin(LED_HOLD_GPIO_Port, LED_HOLD_Pin, GPIO_PIN_SET);
//                      led_counter=LED_FLASH_DELAY;
//                      LOG_DEBUG("Ges: HOLD!\n");
//                      Ges_Log();
//                      if (!sw_state)
//                      {
//                          HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_SET);
//                          HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_SET);
//                          sw_state=1;
//                      }
//                      else
//                      {
//                          HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_RESET);
//                          HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_RESET);
//                          sw_state=0;
//                      }
//                  }
            //if (gs.hold_counter<SAMPLE_HOLD_COUNT)
            //{
                gs.hold_counter++;
                if (gs.hold_counter==SAMPLE_HOLD_COUNT)
                {
                    //HAL_GPIO_WritePin(LED_HOLD_GPIO_Port, LED_HOLD_Pin, GPIO_PIN_RESET);
                    HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
                    HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
                    HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_RESET);
                    HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_RESET);
                    led_counter=LED_FLASH_DELAY;
                    LOG_DEBUG("                         Ges: HOLD!\r\n");
                    Ges_Log();
                    if (!sw_state)
                    {
                        //HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_SET);
                        //HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_SET);
                        sw_state=1;
                    }
                    else
                    {
                        //HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_RESET);
                        //HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_RESET);
                        sw_state=0;
                    }
                }
            //}

            if(gs.hold_counter>5)
            {
                if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)
                {
                    gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
                    gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
                }
                gs.last_ges = GES_NULL;
                gs.hold_counter=0;
            }
        }
#endif
        else if (res==GES_LEVEL2_DCLK)
        {
            HAL_GPIO_WritePin(LED_DCLK_GPIO_Port, LED_DCLK_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
            LOG_DEBUG("                         Ges: DCLK!\r\n");
            Ges_Log();
        }
        else if (res==GES_LEVEL2_APPROACH)
        {
            if(gs.approach_counter)
            {
                LOG_DEBUG("                         Ges: APPROACH!\r\n");
                HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_RESET);
                led_counter=100;
                Ges_Log();
            }
            gs.approach_counter++;
        }
        else if (res==GES_LEVEL2_LEAVE)
        {
            LOG_DEBUG("                         Ges: LEAVE!\r\n");
            HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_RESET);
            led_counter=100;
            Ges_Log();
        }

        //准备接受下一手势动作
        if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)
        {
            gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
            gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
        }
    }
    else
    {
        LOG_DEBUG("Ges Analysis fail.\r\n");

        //当前是long采样，改变sample_size继续采样
        if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)
        {
            gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
            gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
            return;
        }
        gs.last_ges = GES_NULL;
        gs.hold_counter=0;
        gs.approach_counter=0;
    }
#if (LOG_ENABLE)
    LOG_DEBUG("\r\n\n");
#endif
    //}
}
#endif

//系统时钟自加
void Systick_Inc(void)
{
    __disable_irq();
    sys_tick++;
    __enable_irq();
}

//获得系统时钟
uint64_t Systick_Get(void)
{
    return sys_tick;
}
